# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name gf22_min -timing {/nfsd/ichome/lib/gf22/StdCells/GF22FDX_SC8T_104CPP_BASE_CSC20R_FDK_RELV05R40/model/timing/lib/GF22FDX_SC8T_104CPP_BASE_CSC20R_FFG_0P945V_0P00V_0P00V_0P00V_M40C.lib} 


create_library_set -name gf22_max -timing {/nfsd/ichome/lib/gf22/StdCells/GF22FDX_SC8T_104CPP_BASE_CSC20R_FDK_RELV05R40/model/timing/lib/GF22FDX_SC8T_104CPP_BASE_CSC20R_FFG_0P72V_0P00V_0P00V_0P00V_125C.lib} 

create_rc_corner -name default_rc_corner -T 25 -preRoute_res 1.0 -preRoute_cap 1.0 -preRoute_clkres 0 -preRoute_clkcap 0 -postRoute_res {1 1 1} -postRoute_cap {1 1 1} -postRoute_xcap {1 1 1} -postRoute_clkres {0 0 0} -postRoute_clkcap {0 0 0}

create_delay_corner -name cornerFaraday -rc_corner default_rc_corner -early_library_set gf22_min -late_library_set gf22_max -early_opcond_library GF22FDX_SC8T_104CPP_BASE_CSC20R_FFG_0P945V_0P00V_0P00V_0P00V_M40C -late_opcond_library GF22FDX_SC8T_104CPP_BASE_CSC20R_FFG_0P72V_0P00V_0P00V_0P00V_125C

create_constraint_mode -name FFT -sdc_files {FFT_verylog.sdc}

create_analysis_view -name Typ_Case -constraint_mode {FFT} -delay_corner {cornerFaraday}

set_analysis_view -setup {Typ_Case} -hold {Typ_Case}
